In [148]:
print('Hello')

Hello

In [11]:
import pandas as pd
import numpy as np

In [150]:
d1 = pd.read_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/4. Python Advance/data/weather_2012.csv")
d1

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog
...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11.3,99.89,Snow

In [151]:
d1['Visibility (km)'].head()

0    8.0
1    8.0
2    4.0
3    4.0
4    4.8
Name: Visibility (km), dtype: float64

In [152]:
d1['Visibility (km)'].head() + 5

0    13.0
1    13.0
2     9.0
3     9.0
4     9.8
Name: Visibility (km), dtype: float64

In [153]:
#new column is created.

d1['new_temp_col'] = d1['Temp (C)'] + d1['Dew Point Temp (C)']

In [154]:
d1.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog,-4.8

.apply() function

If we want to apply any logic then we first create a function for storing that logic and then we pass that function in apply function.

In [155]:
def times2(value):
    return value * 2

In [156]:
d1['Visibility (km)'].head()

0    8.0
1    8.0
2    4.0
3    4.0
4    4.8
Name: Visibility (km), dtype: float64

In [157]:
d1['Visibility (km)'].apply(times2).head()

0    16.0
1    16.0
2     8.0
3     8.0
4     9.6
Name: Visibility (km), dtype: float64

.describe() function

In [158]:
d1['Visibility (km)'].describe()

count    8784.000000
mean       27.664447
std        12.622688
min         0.200000
25%        24.100000
50%        25.000000
75%        25.000000
max        48.300000
Name: Visibility (km), dtype: float64

Adding / Updating Columns

In [159]:
#Q. Update value of Visibility by multiplying into 1000
updated_visibility = d1['Visibility (km)'] * 1000   #good practice to store it in a variable
d1['Visibility (km)'] = updated_visibility

In [160]:
d1['Visibility (km)'].head()

0    8000.0
1    8000.0
2    4000.0
3    4000.0
4    4800.0
Name: Visibility (km), dtype: float64

.rename() function               
renaming columns in dataframe

In [161]:
d1.rename(columns={'Visibility (km)': 'Visibility (kilometer)'}, inplace=True)  #if we want to store it in variable then we will remove inplace parameter.
d1

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (kilometer),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8
...,...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9700.0,100.13,Snow,-2.6
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9700.0,100.03,Snow,-2.2
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4800.0,99.95,Snow,-2.0
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9700.0,99.91,Snow,-2.0
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11300.0,99.89,Snow,-2.1

In [162]:
d1.rename(columns={'Visibility (kilometer)': 'Visibility (km)'}, inplace=True)

.drop() function             
used to drop column(s) of a dataframe

In [163]:
d1.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8

In [164]:
#axis: 0 means row, 1 means column
#d1 = d1.drop(labels=['Temp (C)'],axis=1)
d1

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8
...,...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9700.0,100.13,Snow,-2.6
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9700.0,100.03,Snow,-2.2
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4800.0,99.95,Snow,-2.0
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9700.0,99.91,Snow,-2.0
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11300.0,99.89,Snow,-2.1

.sort_values() function

In [165]:
d1.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8

In [166]:
sorted_visibility = d1.sort_values('Visibility (km)', ascending=False)
sorted_visibility

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
3974,2012-06-14 14:00:00,22.4,5.5,33,15,48300.0,102.17,Clear,27.9
2298,2012-04-05 18:00:00,6.6,-7.0,37,20,48300.0,100.75,Mostly Cloudy,-0.4
2311,2012-04-06 07:00:00,0.4,-8.9,50,15,48300.0,101.30,Clear,-8.5
2312,2012-04-06 08:00:00,1.1,-8.8,48,19,48300.0,101.34,Clear,-7.7
2313,2012-04-06 09:00:00,2.1,-8.4,46,17,48300.0,101.37,Clear,-6.3
...,...,...,...,...,...,...,...,...,...
1828,2012-03-17 04:00:00,0.3,0.1,99,0,200.0,102.15,Fog,0.4
1830,2012-03-17 06:00:00,-0.1,-0.4,98,4,200.0,102.26,Freezing Fog,-0.5
1834,2012-03-17 10:00:00,2.6,2.6,100,0,200.0,102.37,Fog,5.2
1833,2012-03-17 09:00:00,1.6,1.5,99,4,200.0,102.38,Fog,3.1
1831,2012-03-17 07:00:00,0.5,0.4,99,0,200.0,102.34,Fog,0.9

In [167]:
#Q. Which were the top 10 hottest values and their counts?
d1.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8

In [168]:
r = d1['Temp (C)'].value_counts().sort_values(ascending=False)
r.loc[:10]

 16.6    65
 1.1     58
 0.8     47
 1.5     45
 19.3    44
         ..
 25.9    17
 6.4     17
 24.0    17
-6.8     17
 10.0    17
Name: Temp (C), Length: 256, dtype: int64

.value_counts()                        
It will count the number of times the records are present.

In [169]:
d1['Temp (C)'].value_counts()

 16.6    65
 1.1     58
 0.8     47
 1.5     45
 19.3    44
         ..
-20.7     1
-21.0     1
 31.8     1
 32.6     1
-21.3     1
Name: Temp (C), Length: 533, dtype: int64

In [170]:
d1.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8

In [171]:
d1['Date/Time']

0       2012-01-01 00:00:00
1       2012-01-01 01:00:00
2       2012-01-01 02:00:00
3       2012-01-01 03:00:00
4       2012-01-01 04:00:00
               ...
8779    2012-12-31 19:00:00
8780    2012-12-31 20:00:00
8781    2012-12-31 21:00:00
8782    2012-12-31 22:00:00
8783    2012-12-31 23:00:00
Name: Date/Time, Length: 8784, dtype: object

Changing object to datetime dataype of a column using to_datetime()

In [172]:
d1.dtypes

Date/Time              object
Temp (C)              float64
Dew Point Temp (C)    float64
Rel Hum (%)             int64
Wind Spd (km/h)         int64
Visibility (km)       float64
Stn Press (kPa)       float64
Weather                object
new_temp_col          float64
dtype: object

In [173]:
#converting object datatype to datetime format
d1['Date/Time'] = pd.to_datetime(d1['Date/Time'],infer_datetime_format=True)

In [174]:
d1

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8
...,...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9700.0,100.13,Snow,-2.6
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9700.0,100.03,Snow,-2.2
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4800.0,99.95,Snow,-2.0
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9700.0,99.91,Snow,-2.0
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11300.0,99.89,Snow,-2.1

.dtypes            
this attribute is used to get the columns with its datatypes info.

In [175]:
d1.dtypes

Date/Time             datetime64[ns]
Temp (C)                     float64
Dew Point Temp (C)           float64
Rel Hum (%)                    int64
Wind Spd (km/h)                int64
Visibility (km)              float64
Stn Press (kPa)              float64
Weather                       object
new_temp_col                 float64
dtype: object

In [176]:
d1.dtypes

Date/Time             datetime64[ns]
Temp (C)                     float64
Dew Point Temp (C)           float64
Rel Hum (%)                    int64
Wind Spd (km/h)                int64
Visibility (km)              float64
Stn Press (kPa)              float64
Weather                       object
new_temp_col                 float64
dtype: object

.describe()               
this function gives all the aggregate functions values of all columns.

In [177]:
d1.describe()

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),new_temp_col
count,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000
mean,8.798144,2.555294,67.431694,14.945469,27664.446721,101.051623,11.353438
std,11.687883,10.883072,16.918881,8.688696,12622.688245,0.844005,22.188521
min,-23.300000,-28.500000,18.000000,0.000000,200.000000,97.520000,-51.800000
25%,0.100000,-5.900000,56.000000,9.000000,24100.000000,100.560000,-5.300000
50%,9.300000,3.300000,68.000000,13.000000,25000.000000,101.070000,12.200000
75%,18.800000,11.800000,81.000000,20.000000,25000.000000,101.590000,30.600000
max,33.000000,24.400000,100.000000,83.000000,48300.000000,103.650000,53.400000

dt.month           
it is a pandas package to extract month from a column.

In [178]:
d1['Date/Time'].dt.month

0        1
1        1
2        1
3        1
4        1
        ..
8779    12
8780    12
8781    12
8782    12
8783    12
Name: Date/Time, Length: 8784, dtype: int64

Pivot Tables                        
Pivot table first groups the data and then apply aggregate calculations on it.

In [179]:
p1 = {'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
p1

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [180]:
df = pd.DataFrame(p1)   #dataframe means 2d array, having both x and y axis.
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [181]:
pivot_df = df.pivot_table(
    #NOTE:we have to mention column names directly to values and index variables, not to mention like a list.
    values='D', #using aggregate on this column
    index='A',  #using as a new index on ths column
    columns=['C'],  #using as a new column (optional)
    aggfunc=np.sum  #aggregate function used
)
pivot_df

C    x  y
A
bar  4  6
foo  3  3

What is the mean temperature recorded by month?

In [182]:
d1[['Temp (C)','Date/Time']]

      Temp (C)           Date/Time
0         -1.8 2012-01-01 00:00:00
1         -1.8 2012-01-01 01:00:00
2         -1.8 2012-01-01 02:00:00
3         -1.5 2012-01-01 03:00:00
4         -1.5 2012-01-01 04:00:00
...        ...                 ...
8779       0.1 2012-12-31 19:00:00
8780       0.2 2012-12-31 20:00:00
8781      -0.5 2012-12-31 21:00:00
8782      -0.2 2012-12-31 22:00:00
8783       0.0 2012-12-31 23:00:00

[8784 rows x 2 columns]

In [183]:
mean_temp_df = d1.pivot_table(
    values='Temp (C)',
    index=d1['Date/Time'].dt.month,
    aggfunc=np.mean
)
mean_temp_df

            Temp (C)
Date/Time
1          -7.371505
2          -4.225000
3           3.121237
4           7.009306
5          16.237769
6          20.134028
7          22.790054
8          22.279301
9          16.484444
10         10.954973
11          0.931389
12         -3.306317

In [184]:
d1.dtypes

Date/Time             datetime64[ns]
Temp (C)                     float64
Dew Point Temp (C)           float64
Rel Hum (%)                    int64
Wind Spd (km/h)                int64
Visibility (km)              float64
Stn Press (kPa)              float64
Weather                       object
new_temp_col                 float64
dtype: object

In [185]:
d1.describe()

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),new_temp_col
count,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000
mean,8.798144,2.555294,67.431694,14.945469,27664.446721,101.051623,11.353438
std,11.687883,10.883072,16.918881,8.688696,12622.688245,0.844005,22.188521
min,-23.300000,-28.500000,18.000000,0.000000,200.000000,97.520000,-51.800000
25%,0.100000,-5.900000,56.000000,9.000000,24100.000000,100.560000,-5.300000
50%,9.300000,3.300000,68.000000,13.000000,25000.000000,101.070000,12.200000
75%,18.800000,11.800000,81.000000,20.000000,25000.000000,101.590000,30.600000
max,33.000000,24.400000,100.000000,83.000000,48300.000000,103.650000,53.400000

To find STD using pivot_table

In [186]:
d1.pivot_table(
    values='Temp (C)',
    index=d1['Date/Time'].dt.month,
    aggfunc=np.std
)

           Temp (C)
Date/Time
1          6.382532
2          5.132305
3          7.808771
4          5.031103
5          5.216031
6          5.011927
7          4.026849
8          3.708003
9          5.285297
10         4.217400
11         4.921951
12         5.623087

Group By (same as in SQL)             
we also have to use aggregate function with group by clause

In [187]:
#it perform aggregate on all columns
#NOTE: in pivot_table(), aggfunc=np.mean is used in above eg.
#if we want to use multiple columns then we will use series just like list with values in double square brackets.

d1.groupby(d1['Date/Time'].dt.month).agg(np.mean)

C:\Users\DELL\AppData\Local\Temp\ipykernel_30368\893294967.py:5: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  d1.groupby(d1['Date/Time'].dt.month).agg(np.mean)

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),new_temp_col
Date/Time,,,,,,,
1,-7.371505,-12.294758,68.383065,18.108871,22100.268817,101.005349,-19.666263
2,-4.225000,-9.221695,68.956897,14.837644,25182.183908,101.142414,-13.446695
3,3.121237,-3.488575,64.862903,14.514785,26177.956989,101.335255,-0.367339
4,7.009306,-1.934583,56.150000,17.369444,31777.083333,100.716833,5.074722
5,16.237769,8.080780,61.760753,12.846774,29418.548387,101.057164,24.318548
6,20.134028,11.738056,60.643056,14.681944,32104.166667,100.784222,31.872083
7,22.790054,14.595430,62.017473,11.887097,33655.107527,100.828333,37.385484
8,22.279301,15.644758,67.943548,13.931452,30192.607527,100.927097,37.924059
9,16.484444,10.757917,71.165278,14.108333,30603.472222,101.087903,27.242361
10,10.954973,6.533468,75.731183,15.475806,25111.021505,100.909368,17.488441
11,0.931389,-4.179306,69.984722,13.973611,26077.083333,101.658306,-3.247917
12,-3.306317,-6.129032,81.299731,17.614247,19733.198925,101.174409,-9.435349

In [188]:
d1.groupby(d1['Date/Time'].dt.month).agg(np.mean)['Temp (C)']

C:\Users\DELL\AppData\Local\Temp\ipykernel_30368\2248820700.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  d1.groupby(d1['Date/Time'].dt.month).agg(np.mean)['Temp (C)']

Date/Time
1     -7.371505
2     -4.225000
3      3.121237
4      7.009306
5     16.237769
6     20.134028
7     22.790054
8     22.279301
9     16.484444
10    10.954973
11     0.931389
12    -3.306317
Name: Temp (C), dtype: float64

In [189]:
d1.groupby(d1['Date/Time'].dt.month).agg(np.mean).reset_index()

C:\Users\DELL\AppData\Local\Temp\ipykernel_30368\3869795397.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  d1.groupby(d1['Date/Time'].dt.month).agg(np.mean).reset_index()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),new_temp_col
0,1,-7.371505,-12.294758,68.383065,18.108871,22100.268817,101.005349,-19.666263
1,2,-4.225000,-9.221695,68.956897,14.837644,25182.183908,101.142414,-13.446695
2,3,3.121237,-3.488575,64.862903,14.514785,26177.956989,101.335255,-0.367339
3,4,7.009306,-1.934583,56.150000,17.369444,31777.083333,100.716833,5.074722
4,5,16.237769,8.080780,61.760753,12.846774,29418.548387,101.057164,24.318548
5,6,20.134028,11.738056,60.643056,14.681944,32104.166667,100.784222,31.872083
6,7,22.790054,14.595430,62.017473,11.887097,33655.107527,100.828333,37.385484
7,8,22.279301,15.644758,67.943548,13.931452,30192.607527,100.927097,37.924059
8,9,16.484444,10.757917,71.165278,14.108333,30603.472222,101.087903,27.242361
9,10,10.954973,6.533468,75.731183,15.475806,25111.021505,100.909368,17.488441
10,11,0.931389,-4.179306,69.984722,13.973611,26077.083333,101.658306,-3.247917
11,12,-3.306317,-6.129032,81.299731,17.614247,19733.198925,101.174409,-9.435349

To find STD on each date using groupby function

In [190]:
d1.groupby(d1['Date/Time'].dt.month).agg(np.std)

C:\Users\DELL\AppData\Local\Temp\ipykernel_30368\2978523347.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  d1.groupby(d1['Date/Time'].dt.month).agg(np.std)

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),new_temp_col
Date/Time,,,,,,,
1,6.382532,7.314661,11.151944,10.357420,11634.944115,1.036334,13.590543
2,5.132305,6.019910,12.208306,8.650417,12089.907741,0.954279,10.955759
3,7.808771,8.293714,19.478739,9.282456,14213.379594,0.844718,15.447941
4,5.031103,5.681212,19.009616,9.598456,11901.921391,0.832138,9.478725
5,5.216031,5.340641,19.030379,7.117409,13546.465772,0.599110,9.124940
6,5.011927,4.094923,15.129909,6.940655,12061.541746,0.659807,8.051533
7,4.026849,3.732698,15.865721,6.233081,12252.497237,0.483196,6.449145
8,3.708003,3.264215,15.362100,7.535783,11430.615153,0.415493,5.842322
9,5.285297,4.403377,16.655360,8.152540,12134.068025,0.607169,8.851938
10,4.217400,5.016548,15.495853,9.242476,10929.073283,0.778110,8.679454
11,4.921951,5.016951,13.564087,8.562825,8763.644389,1.097922,9.535484
12,5.623087,6.218090,10.581489,9.296108,11433.704396,1.033942,11.724739

To find max on each date value using groupby function

In [191]:
d1.groupby(d1['Date/Time'].dt.month).agg(np.max)

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
Date/Time,,,,,,,,,
1,2012-01-31 23:00:00,5.3,3.6,93,83,48300.0,103.09,"Snow,Blowing Snow",8.6
2,2012-02-29 23:00:00,6.1,1.6,94,41,48300.0,102.72,"Snow,Haze",5.2
3,2012-03-31 23:00:00,25.5,12.8,100,63,48300.0,103.12,"Snow,Ice Pellets",37.4
4,2012-04-30 23:00:00,27.8,15.8,94,52,48300.0,102.44,Snow,39.4
5,2012-05-31 23:00:00,31.2,19.0,95,35,48300.0,101.95,"Thunderstorms,Rain Showers",45.8
6,2012-06-30 23:00:00,33.0,21.1,90,37,48300.0,102.40,"Thunderstorms,Rain Showers,Fog",53.0
7,2012-07-31 23:00:00,33.0,23.1,98,35,48300.0,101.75,"Thunderstorms,Rain,Fog",51.7
8,2012-08-31 23:00:00,32.8,24.4,99,44,48300.0,102.10,"Thunderstorms,Rain Showers",53.4
9,2012-09-30 23:00:00,28.4,20.2,100,44,48300.0,102.06,"Thunderstorms,Rain Showers",46.6
10,2012-10-31 23:00:00,21.1,15.6,100,54,48300.0,102.57,"Rain,Fog",36.1
11,2012-11-30 23:00:00,17.5,10.0,95,48,48300.0,103.65,Snow Showers,26.0
12,2012-12-31 23:00:00,11.9,9.7,100,48,48300.0,103.27,"Snow,Ice Pellets",20.3

In [192]:
d1

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8000.0,101.24,Fog,-5.7
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8000.0,101.24,Fog,-5.5
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4000.0,101.26,"Freezing Drizzle,Fog",-5.2
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4000.0,101.27,"Freezing Drizzle,Fog",-4.7
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4800.0,101.23,Fog,-4.8
...,...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9700.0,100.13,Snow,-2.6
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9700.0,100.03,Snow,-2.2
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4800.0,99.95,Snow,-2.0
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9700.0,99.91,Snow,-2.0
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11300.0,99.89,Snow,-2.1

In [194]:
d1.groupby(d1['Date/Time'].dt.month).agg(np.max)

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather,new_temp_col
Date/Time,,,,,,,,,
1,2012-01-31 23:00:00,5.3,3.6,93,83,48300.0,103.09,"Snow,Blowing Snow",8.6
2,2012-02-29 23:00:00,6.1,1.6,94,41,48300.0,102.72,"Snow,Haze",5.2
3,2012-03-31 23:00:00,25.5,12.8,100,63,48300.0,103.12,"Snow,Ice Pellets",37.4
4,2012-04-30 23:00:00,27.8,15.8,94,52,48300.0,102.44,Snow,39.4
5,2012-05-31 23:00:00,31.2,19.0,95,35,48300.0,101.95,"Thunderstorms,Rain Showers",45.8
6,2012-06-30 23:00:00,33.0,21.1,90,37,48300.0,102.40,"Thunderstorms,Rain Showers,Fog",53.0
7,2012-07-31 23:00:00,33.0,23.1,98,35,48300.0,101.75,"Thunderstorms,Rain,Fog",51.7
8,2012-08-31 23:00:00,32.8,24.4,99,44,48300.0,102.10,"Thunderstorms,Rain Showers",53.4
9,2012-09-30 23:00:00,28.4,20.2,100,44,48300.0,102.06,"Thunderstorms,Rain Showers",46.6
10,2012-10-31 23:00:00,21.1,15.6,100,54,48300.0,102.57,"Rain,Fog",36.1
11,2012-11-30 23:00:00,17.5,10.0,95,48,48300.0,103.65,Snow Showers,26.0
12,2012-12-31 23:00:00,11.9,9.7,100,48,48300.0,103.27,"Snow,Ice Pellets",20.3

In [196]:
d1.pivot_table(
    values=d1[['Temp (C)','Visibility (km)','Wind Spd (km/h)']],
    index=d1['Date/Time'].dt.month,
    aggfunc=np.max
)

           Temp (C)  Visibility (km)  Wind Spd (km/h)
Date/Time
1               5.3          48300.0               83
2               6.1          48300.0               41
3              25.5          48300.0               63
4              27.8          48300.0               52
5              31.2          48300.0               35
6              33.0          48300.0               37
7              33.0          48300.0               35
8              32.8          48300.0               44
9              28.4          48300.0               44
10             21.1          48300.0               54
11             17.5          48300.0               48
12             11.9          48300.0               48

Concatenation, Merge & Join                       
3 key ways of combining dataframes together.

In [208]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}, index=[0, 1, 2, 3])

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
}, index=[4, 5, 6, 7])

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'E': ['D8', 'D9', 'D10', 'D11']
}, index=[8, 9, 10, 11])

df4 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'E': ['D8', 'D9', 'D10', 'D11']
})

In [209]:
print(df1)
print(df2)
print(df3)
print(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    E
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
     A    B    C    E
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [212]:
# if you don't specify an axis, it defaults to axis=0, which means it appends/concats to rows
#join vertically
pd.concat([df1,df2,df3])

      A    B    C    D    E
0    A0   B0   C0   D0  NaN
1    A1   B1   C1   D1  NaN
2    A2   B2   C2   D2  NaN
3    A3   B3   C3   D3  NaN
4    A4   B4   C4   D4  NaN
5    A5   B5   C5   D5  NaN
6    A6   B6   C6   D6  NaN
7    A7   B7   C7   D7  NaN
8    A8   B8   C8  NaN   D8
9    A9   B9   C9  NaN   D9
10  A10  B10  C10  NaN  D10
11  A11  B11  C11  NaN  D11

In [213]:
#axis=1 means it will perform concat only on columns i.e in below o/p rows are seperated from each other.
#join horizontally
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    E
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Join                    
Outer means union             
inner means intersection

In [214]:
# Join
left_df = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2']) 

right_df = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
}, index=['K0', 'K2', 'K3'])

In [215]:
print(left_df)
print(right_df)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [216]:
left_df.join(right_df,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [217]:
left_df.join(right_df,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

Merge                                
Many a times you will be working with multiple dataframes all at once.

The merge function allows them to be combined into a single data frame

In [218]:
# Merging on multiple keys
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
    
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [220]:
print(left)
print(right)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [221]:
# other options are 'inner', 'left', 'right'
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

DateTime

Convert strings to datetime

In [13]:
df = pd.DataFrame({'date':['20/10/2000','18/11/2000','30/12/2000'],
                   'value':[2,3,4]})
df

         date  value
0  20/10/2000      2
1  18/11/2000      3
2  30/12/2000      4

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [15]:
df['date'] = pd.to_datetime(df['date']) #yyyy-mm-dd
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_8228\1621113520.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['date'] = pd.to_datetime(df['date'])

        date  value
0 2000-10-20      2
1 2000-11-18      3
2 2000-12-30      4

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [17]:
df2 = pd.DataFrame({'date':['15/10/2022','18/11/2022','21/12/2022'],
                    'value':[1,2,3]})
df2

         date  value
0  15/10/2022      1
1  18/11/2022      2
2  21/12/2022      3

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

dayfirst (takes boolean value)               
in our date column value, if its first day then we have to mention dayfirst=True

In [19]:
df2['date'] = pd.to_datetime(df2['date'],dayfirst=True) #yyyy-mm-dd
df2

        date  value
0 2022-10-15      1
1 2022-11-18      2
2 2022-12-21      3

In [21]:
df3 = pd.DataFrame({'date':['15/10/2022','18/11/2022','21/12/2022'],
                    'value':[1,2,3]})
df3

         date  value
0  15/10/2022      1
1  18/11/2022      2
2  21/12/2022      3

In [22]:
df3['date'] = pd.to_datetime(df3['date'],dayfirst=False)
df3

C:\Users\DELL\AppData\Local\Temp\ipykernel_8228\239212617.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df3['date'] = pd.to_datetime(df3['date'],dayfirst=False)

        date  value
0 2022-10-15      1
1 2022-11-18      2
2 2022-12-21      3

In [41]:
df = pd.DataFrame({'date':['2020/6/13 15:5:1','2020/6/21 20:25:11','2020/6/23 23:5:7'],
                  'value':[1,2,3]})
df

                 date  value
0    2020/6/13 15:5:1      1
1  2020/6/21 20:25:11      2
2    2020/6/23 23:5:7      3

In [43]:
df['date'] = pd.to_datetime(df['date'],format="%Y-%m-%d %H:%M:%S")
df

                 date  value
0 2020-06-13 15:05:01      1
1 2020-06-21 20:25:11      2
2 2020-06-23 23:05:07      3

infer_datetime_format

In [44]:
pd.to_datetime(df['date'],infer_datetime_format=True)

0   2020-06-13 15:05:01
1   2020-06-21 20:25:11
2   2020-06-23 23:05:07
Name: date, dtype: datetime64[ns]

Handle parsing error

In [ ]:
#errors{â€˜ignoreâ€™, â€˜raiseâ€™, â€˜coerceâ€™}, default â€˜raiseâ€™
#If 'raise', then invalid parsing will raise an exception.

#If 'coerce', then invalid parsing will be set as NaT.

#If 'ignore', then invalid parsing will return the input

In [54]:
df = pd.DataFrame({'date':['2020/6/13 15:5:1','2020/c/a 20:25:11','2020/6/23 23:5:7'],
                  'value':[1,2,3]})
df

                date  value
0   2020/6/13 15:5:1      1
1  2020/c/a 20:25:11      2
2   2020/6/23 23:5:7      3

In [55]:
#error
#df['date'] = pd.to_datetime(df['date'])

In [56]:
df['date'] = pd.to_datetime(df['date'],errors='ignore')
df

                date  value
0   2020/6/13 15:5:1      1
1  2020/c/a 20:25:11      2
2   2020/6/23 23:5:7      3

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [58]:
df['date'] = pd.to_datetime(df['date'],errors='coerce')
df

                 date  value
0 2020-06-13 15:05:01      1
1                 NaT      2
2 2020-06-23 23:05:07      3

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

Get Year, Month & Day

In [60]:
df = pd.DataFrame({'date':['2020/6/13 15:5:1','2020/c/a 20:25:11','2020/6/23 23:5:7'],
                  'value':[1,2,3]})
df

                date  value
0   2020/6/13 15:5:1      1
1  2020/c/a 20:25:11      2
2   2020/6/23 23:5:7      3

In [64]:
df['date'] = pd.to_datetime(df['date'],errors='coerce')

In [65]:
df

                 date  value
0 2020-06-13 15:05:01      1
1                 NaT      2
2 2020-06-23 23:05:07      3

In [70]:
#created a new column inside dataframe
df['year'] = df['date'].dt.year

In [71]:
df['month'] = df['date'].dt.month

In [72]:
df['day'] = df['date'].dt.day

In [73]:
df

                 date  value    year  month   day
0 2020-06-13 15:05:01      1  2020.0    6.0  13.0
1                 NaT      2     NaN    NaN   NaN
2 2020-06-23 23:05:07      3  2020.0    6.0  23.0

Get the week of year, day of week, & leap year

In [74]:
df

                 date  value    year  month   day
0 2020-06-13 15:05:01      1  2020.0    6.0  13.0
1                 NaT      2     NaN    NaN   NaN
2 2020-06-23 23:05:07      3  2020.0    6.0  23.0

In [75]:
df['date'].dt.week

C:\Users\DELL\AppData\Local\Temp\ipykernel_8228\2158599560.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df['date'].dt.week

0    24.0
1     NaN
2    26.0
Name: date, dtype: float64

In [76]:
df['date'].dt.dayofweek

0    5.0
1    NaN
2    1.0
Name: date, dtype: float64

In [77]:
df['date'].dt.is_leap_year

0     True
1    False
2     True
Name: date, dtype: bool

In [79]:
df['is_month_end'] = df['date'].dt.is_month_end

In [80]:
df

                 date  value    year  month   day  is_month_end
0 2020-06-13 15:05:01      1  2020.0    6.0  13.0         False
1                 NaT      2     NaN    NaN   NaN         False
2 2020-06-23 23:05:07      3  2020.0    6.0  23.0         False

map() function                        
we can map a dictionary to a column using its key values

In [81]:
df

                 date  value    year  month   day  is_month_end
0 2020-06-13 15:05:01      1  2020.0    6.0  13.0         False
1                 NaT      2     NaN    NaN   NaN         False
2 2020-06-23 23:05:07      3  2020.0    6.0  23.0         False

In [83]:
df['weekday'] = df['date'].dt.weekday
df

                 date  value    year  month   day  is_month_end  weekday
0 2020-06-13 15:05:01      1  2020.0    6.0  13.0         False      5.0
1                 NaT      2     NaN    NaN   NaN         False      NaN
2 2020-06-23 23:05:07      3  2020.0    6.0  23.0         False      1.0

In [84]:
mapping = {1:'Monday',2:'Tuesday',3:'Wednesday',4:'Thursday',5:'Friday',6:'Saturday',7:'Sunday'}
mapping

{1: 'Monday',
 2: 'Tuesday',
 3: 'Wednesday',
 4: 'Thursday',
 5: 'Friday',
 6: 'Saturday',
 7: 'Sunday'}

In [86]:
df['dayofweek_name'] = df['date'].dt.weekday.map(mapping)
df

,date,value,year,month,day,is_month_end,weekday,dayofweek_name
0,2020-06-13 15:05:01,1,2020.0,6.0,13.0,False,5.0,Friday
1,NaT,2,NaN,NaN,NaN,False,NaN,NaN
2,2020-06-23 23:05:07,3,2020.0,6.0,23.0,False,1.0,Monday

Get the age from date of birth

In [87]:
df

,date,value,year,month,day,is_month_end,weekday,dayofweek_name
0,2020-06-13 15:05:01,1,2020.0,6.0,13.0,False,5.0,Friday
1,NaT,2,NaN,NaN,NaN,False,NaN,NaN
2,2020-06-23 23:05:07,3,2020.0,6.0,23.0,False,1.0,Monday

to get current date and time

In [101]:
today = pd.to_datetime('today')

In [102]:
pd.to_datetime('today').year

2023

In [104]:
df['date'].dt.year

0    2020.0
1       NaN
2    2020.0
Name: date, dtype: float64

In [105]:
df['age'] = today.year - df['date'].dt.year

In [106]:
df

,date,value,year,month,day,is_month_end,weekday,dayofweek_name,age
0,2020-06-13 15:05:01,1,2020.0,6.0,13.0,False,5.0,Friday,3.0
1,NaT,2,NaN,NaN,NaN,False,NaN,NaN,NaN
2,2020-06-23 23:05:07,3,2020.0,6.0,23.0,False,1.0,Monday,3.0

Performance improvement by setting date column as index.

In [13]:
#using parse_dates attribute as a suffix in below line of code
#by using it, we are explicitly telling pandas to convert it into datetime format while reading the data
df2 = pd.read_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/city_sales.csv",parse_dates=['date'])

In [14]:
df2

                      date  num    city
0      2015-01-01 09:00:00    4  London
1      2015-01-01 09:01:00    4  London
2      2015-01-01 09:02:00    3  London
3      2015-01-01 09:03:00    3  London
4      2015-01-01 09:04:00    3  London
...                    ...  ...     ...
376428 2018-06-06 09:54:00    3  London
376429 2018-06-06 09:55:00    3  London
376430 2018-06-06 09:56:00    3  London
376431 2018-06-06 09:57:00    3  London
376432 2018-06-06 09:58:00    1  London

[376433 rows x 3 columns]

In [15]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [16]:
#setting index on date column
df2 = df2.set_index(['date'])
df2

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

Select data with specific year and perform aggregation

In [17]:
df2.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [22]:
#to get the sum of all num values in 2018
df2.loc['2018','num'].sum()

132127

In [28]:
#groupby function
df2.loc['2018'].groupby('city').sum()

           num
city
London  132127

In [30]:
#to get data for may 2018
df2.loc['2018-5']

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London
...                  ...     ...
2018-05-31 15:56:00    3  London
2018-05-31 15:57:00    3  London
2018-05-31 15:58:00    4  London
2018-05-31 15:59:00    2  London
2018-05-31 16:00:00    3  London

[9683 rows x 2 columns]

In [31]:
df2.loc['2018-5-1']

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London
...                  ...     ...
2018-05-01 15:56:00    2  London
2018-05-01 15:57:00    4  London
2018-05-01 15:58:00    1  London
2018-05-01 15:59:00    4  London
2018-05-01 16:00:00    1  London

[421 rows x 2 columns]

In [34]:
#same as above loc condition
cond = df2.index.month==2
df2[cond]

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London
...                  ...     ...
2018-02-28 15:56:00    3  London
2018-02-28 15:57:00    3  London
2018-02-28 15:58:00    3  London
2018-02-28 15:59:00    2  London
2018-02-28 16:00:00    3  London

[34101 rows x 2 columns]

To find data between two dates

In [37]:
df2.loc['2016' : '2018']

                     num    city
date
2016-01-01 09:00:00    4  London
2016-01-01 09:01:00    3  London
2016-01-01 09:02:00    4  London
2016-01-01 09:03:00    4  London
2016-01-01 09:04:00    2  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[266552 rows x 2 columns]

In [38]:
df2.loc['2018-1-1':'2018-5-1']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-05-01 15:56:00    2  London
2018-05-01 15:57:00    4  London
2018-05-01 15:58:00    1  London
2018-05-01 15:59:00    4  London
2018-05-01 16:00:00    1  London

[36627 rows x 2 columns]

In [39]:
df2.loc['2018-1-1 10:30':'2018-5-1 11:30']

                     num    city
date
2018-01-01 10:30:00    3  London
2018-01-01 10:31:00    4  London
2018-01-01 10:32:00    3  London
2018-01-01 10:33:00    3  London
2018-01-01 10:34:00    3  London
...                  ...     ...
2018-05-01 11:26:00    1  London
2018-05-01 11:27:00    1  London
2018-05-01 11:28:00    3  London
2018-05-01 11:29:00    4  London
2018-05-01 11:30:00    3  London

[36267 rows x 2 columns]

between_time() function

In [40]:
df2.between_time('10:30','12:00')

                     num    city
date
2015-01-01 10:30:00    4  London
2015-01-01 10:31:00    3  London
2015-01-01 10:32:00    3  London
2015-01-01 10:33:00    3  London
2015-01-01 10:34:00    4  London
...                  ...     ...
2018-06-05 11:56:00    3  London
2018-06-05 11:57:00    2  London
2018-06-05 11:58:00    3  London
2018-06-05 11:59:00    3  London
2018-06-05 12:00:00    4  London

[81354 rows x 2 columns]

In [41]:
pd.to_datetime('2018-1-1')

Timestamp('2018-01-01 00:00:00')

In [42]:
pd.Timestamp('2018-1-1')

Timestamp('2018-01-01 00:00:00')

In [45]:
pd.date_range(start='2018-1-1',periods=1)

DatetimeIndex(['2018-01-01'], dtype='datetime64[ns]', freq='D')

In [5]:
#for days
df = pd.DataFrame({'date':pd.date_range('2022-1-1',periods=4)})
df

        date
0 2022-01-01
1 2022-01-02
2 2022-01-03
3 2022-01-04

In [7]:
#for month
df = pd.DataFrame({'date':pd.date_range('2022-1-1',periods=4,freq='M')})
df

        date
0 2022-01-31
1 2022-02-28
2 2022-03-31
3 2022-04-30

In [6]:
df['month'] = df['date'].dt.month_name()
print(df['month'])

0    January
1    January
2    January
3    January
Name: month, dtype: object

Working with different file formats (JSON, CSV, Excel, Avro)

JSON - JavaScript Object Notation, data format                        
JSON is used the most as its human as well as machine readable.
JSON is similar to dctionary which has key & value.                     
JSON means DICTIONARY, both are the same inpython.

Converting DICTIONARY into JSON file.

In [15]:
import json

In [16]:
#Nested Dictionary
data = {'president':{
    'name':'Tushar Annam',
    'species':'Human'
}}
print(data)

{'president': {'name': 'Tushar Annam', 'species': 'Human'}}

dump() method to write a new json file

In [17]:
#Converting Dictionary to JSON file.
#writing a new file
with open('data_file.json','w') as write_file:
    json.dump(data,write_file)

load() method to read a json file

In [18]:
#reading a file
with open('data_file.json','r') as read_file:
    data1 = json.load(read_file)

In [19]:
data1

{'president': {'name': 'Tushar Annam', 'species': 'Human'}}

In [20]:
type(data)

dict

Converting JSON (string) to DataFrame in pandas using read_json() method

In [21]:
#Nested Json String
jsonStr = '''{"I0":{"Courses": "Pandas","Discount": "1200"},
           "I1":{"Courses2": "Hadoop","Discount": "1500"},
           "I2":{"Courses": "Spark","Discount": "1800"}
          }'''

jsonStr

'{"I0":{"Courses": "Pandas","Discount": "1200"},\n           "I1":{"Courses2": "Hadoop","Discount": "1500"},\n           "I2":{"Courses": "Spark","Discount": "1800"}\n          }'

In [22]:
type(jsonStr)

str

read_json() method to read JSON String.

In [23]:
#convert JSON to DataFrame using read_json()
df2 = pd.read_json(jsonStr, orient='index') #it will create index based on key.
#we want to orient this dataframe based on index.
print(df2)

   Courses  Discount Courses2
I0  Pandas      1200      NaN
I2   Spark      1800      NaN
I1     NaN      1500   Hadoop

In [24]:
type(df2)

pandas.core.frame.DataFrame

Convert Dictionary to DataFrame in pandas

In [25]:
data

{'president': {'name': 'Tushar Annam', 'species': 'Human'}}

In [26]:
type(data)  #dictionary

dict

In [27]:
data['president']

{'name': 'Tushar Annam', 'species': 'Human'}

In [28]:
data['president']['name']

'Tushar Annam'

from_dict() method to convert Dictionary to DataFrame

orient are of three types: 'columns', 'index', 'tight'

In [29]:
#if keys should be rows then pass orient='index'
df3 = pd.DataFrame.from_dict(data,orient='index')
#it will consider president as an index
df3

                   name species
president  Tushar Annam   Human

In [30]:
df4 = pd.DataFrame.from_dict(data['president'],orient='index')
df4

                    0
name     Tushar Annam
species         Human

In [31]:
#if keys should be columns then pass orient='columns'
df5 = pd.DataFrame.from_dict(data,orient='columns')
df5

            president
name     Tushar Annam
species         Human

In [33]:
#ERROR
# df6 = pd.DataFrame.from_dict(data['president'],orient='columns')
# df6

Working with CSV files

In [34]:
df = pd.read_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/hrdata.csv")
df

             Name Hire Date   Salary  Sick Days remaining
0  Graham Chapman  03/15/14  50000.0                   10
1     John Cleese  06/01/15  65000.0                    8
2       Eric Idle  05/12/14  45000.0                   10
3     Terry Jones  11/01/13  70000.0                    3
4   Terry Gilliam  08/12/14  48000.0                    7
5   Michael Palin  05/23/13  66000.0                    8

In [36]:
#passing Name column as an index
df = pd.read_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/hrdata.csv", index_col='Name')
df

               Hire Date   Salary  Sick Days remaining
Name
Graham Chapman  03/15/14  50000.0                   10
John Cleese     06/01/15  65000.0                    8
Eric Idle       05/12/14  45000.0                   10
Terry Jones     11/01/13  70000.0                    3
Terry Gilliam   08/12/14  48000.0                    7
Michael Palin   05/23/13  66000.0                    8

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Graham Chapman to Michael Palin
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Hire Date            6 non-null      object
 1   Salary               6 non-null      float64
 2   Sick Days remaining  6 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 192.0+ bytes

In [38]:
#passing 'Hire Date' column as datatime datatype
df = pd.read_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/hrdata.csv", index_col='Name', parse_dates=['Hire Date'])
df

                Hire Date   Salary  Sick Days remaining
Name
Graham Chapman 2014-03-15  50000.0                   10
John Cleese    2015-06-01  65000.0                    8
Eric Idle      2014-05-12  45000.0                   10
Terry Jones    2013-11-01  70000.0                    3
Terry Gilliam  2014-08-12  48000.0                    7
Michael Palin  2013-05-23  66000.0                    8

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Graham Chapman to Michael Palin
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Hire Date            6 non-null      datetime64[ns]
 1   Salary               6 non-null      float64
 2   Sick Days remaining  6 non-null      int64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 192.0+ bytes

to write a new modified CSV using to_csv() method.

In [42]:
df.to_csv("G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/hrdata_modified.csv")

Working with Excel Files                      
1. we have to install openpyxl package.

In [43]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     -------------------------------------- 250.0/250.0 kB 3.8 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

importing Workbook function from openpyxl package

In [44]:
from openpyxl import Workbook

Creating a new xlsx file.

In [46]:
workbook = Workbook()   #creating instance
sheet = workbook.active

sheet['A1'] = 'hello'
sheet['B1'] = 'world!'

workbook.save(filename='G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/hello_world.xlsx')

Reading xlsx file.

In [51]:
from openpyxl import load_workbook
workbook = load_workbook(filename='G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/sample-xlsx-file.xlsx')
workbook.sheetnames

['Employee', 'Department']

In [49]:
sheet = workbook.active

In [52]:
sheet

In [53]:
sheet.title

'Employee'

In [54]:
sheet['A1']

In [55]:
sheet['A1'].value

'Name'

In [56]:
sheet['A2'].value

'Rajeev Singh'

In [60]:
sheet.cell(row=5,column=2).value

'steven@example.com'

In [64]:
sheet['A1:C3']

((<Cell 'Employee'.A1>, <Cell 'Employee'.B1>, <Cell 'Employee'.C1>),
 (<Cell 'Employee'.A2>, <Cell 'Employee'.B2>, <Cell 'Employee'.C2>),
 (<Cell 'Employee'.A3>, <Cell 'Employee'.B3>, <Cell 'Employee'.C3>))

iter_rows() method to iterate/read worksheet

In [65]:
for row in sheet.iter_rows(values_only=True):
    print(row)

('Name', 'Email', 'Date Of Birth', 'Salary', 'Department')
('Rajeev Singh', 'rajeev@example.com', datetime.datetime(1992, 7, 21, 0, 0), 1500000.0, 'Software Engineering')
('John Doe', 'john@example.com', datetime.datetime(1965, 1, 13, 0, 0), 1300000.0, 'Sales')
('Jack Sparrow', 'jack@example.com', datetime.datetime(1986, 12, 19, 0, 0), 1000000.0, 'HR')
('Steven Cook', 'steven@example.com', datetime.datetime(1994, 5, 4, 0, 0), 1200000.0, 'Marketing')

We can do operation of Excel in both ways either using Excel level packages or using DataFrame

Reading Excel file as a DataFrame using Pandas

In [66]:
excel_df = pd.read_excel('G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/sample-xlsx-file.xlsx')
excel_df

,Name,Email,Date Of Birth,Salary,Department
0,Rajeev Singh,rajeev@example.com,1992-07-21,1500000,Software Engineering
1,John Doe,john@example.com,1965-01-13,1300000,Sales
2,Jack Sparrow,jack@example.com,1986-12-19,1000000,HR
3,Steven Cook,steven@example.com,1994-05-04,1200000,Marketing

In [67]:
excel_df.to_excel('G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/sample-xlsx-file-modified.xlsx')

Working with Apache AVRO               
1. it has .avro file extension
2. It is typically used with Spark but Spark is independent of Avro.
3. It is a row_base file format.
4. One benefit is that schema and metadata travels with the data.
5. we have to install avro-Python3 package to use it.

In [4]:
pip install avro-python3

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: avro-python3 in c:\users\dell\appdata\roaming\python\python310\site-packages (1.10.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import copy, json, avro

In [3]:
from avro.datafile import DataFileWriter, DataFileReader
from avro.io import DatumWriter, DatumReader

In [6]:
#entire schema
schema = {
    'name':'avro.example.User',
    'type':'record',
    'fields':[
        {'name':'name','type':'string'},
        {'name':'age','type':'int'}
    ]
}

In [7]:
schema_parsed = avro.schema.Parse(json.dumps(schema))

In [8]:
schema_parsed

To write Avro file

In [20]:
with open('users.avro','wb') as f:  #wb means write binary
    writer = DataFileWriter(f,DatumWriter(),schema_parsed)
    writer.append({'name':'Tushar Annam','age':25})
    writer.append({'name':'John wick','age':37})
    writer.close()

To read Avro file

In [22]:
with open('users.avro','rb') as f:   #rb means read binary
    reader = DataFileReader(f,DatumReader())
    metadata = copy.deepcopy(reader.meta)
    schema_from_file = json.loads(metadata['avro.schema'])    
    users = [user for user in reader]
    reader.close()

print(f'Schema that we specified: {schema}')
print(f'Schema that we parsed: {schema_parsed}')
print(f'Schema from users.avro file: {s}')
print(f'(Actual value) Users: {users}')

Schema that we specified: {'name': 'avro.example.User', 'type': 'record', 'fields': [{'name': 'name', 'type': 'string'}, {'name': 'age', 'type': 'int'}]}
Schema that we parsed: {"type": "record", "name": "User", "namespace": "avro.example", "fields": [{"type": "string", "name": "name"}, {"type": "int", "name": "age"}]}
Schema from users.avro file: {'type': 'record', 'name': 'User', 'namespace': 'avro.example', 'fields': [{'type': 'string', 'name': 'name'}, {'type': 'int', 'name': 'age'}]}
(Actual value) Users: [{'name': 'Tushar Annam', 'age': 25}, {'name': 'John wick', 'age': 37}]

 Reading Avro using Pandas

In [23]:
pip install pandavro

Defaulting to user installation because normal site-packages is not writeable
Collecting pandavro
  Downloading pandavro-1.7.2-py3-none-any.whl (8.8 kB)
Requirement already satisfied: numpy>=1.15.4 in c:\users\dell\appdata\roaming\python\python310\site-packages (from pandavro) (1.23.4)
Requirement already satisfied: pandas>=1.1 in c:\users\dell\appdata\roaming\python\python310\site-packages (from pandavro) (1.5.1)
Collecting fastavro~=1.5.1
  Downloading fastavro-1.5.4-cp310-cp310-win_amd64.whl (432 kB)
     -------------------------------------- 432.4/432.4 kB 5.4 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dell\appdata\roaming\python\python310\site-packages (from pandas>=1.1->pandavro) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\roaming\python\python310\site-packages (from pandas>=1.1->pandavro) (2022.6)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.1->pandas>=1.1->pandavro) (1.16.0)
Installing collected packages: fastavro, pandavro
Successfully installed fastavro-1.5.4 pandavro-1.7.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import copy, json, pandas as pd, pandavro as pdx
from avro.datafile import DataFileReader
from avro.io import DatumReader

In [5]:
users = [{'name':'Tushar Annam','age':25},
         {'name':'James Bond','age':32}]
print(users)
print(type(users))

[{'name': 'Tushar Annam', 'age': 25}, {'name': 'James Bond', 'age': 32}]
<class 'list'>

Converting List to Pandas DataFrame

In [6]:
users_df = pd.DataFrame.from_records(users)
print(users_df)

           name  age
0  Tushar Annam   25
1    James Bond   32

In [7]:
print(type(users_df))

<class 'pandas.core.frame.DataFrame'>

Storing the DataFrame in .avro file using to_avro function

In [12]:
pdx.to_avro('G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/users_test1.avro',users_df)

To read the data from avro file using from_avro function.

In [14]:
users_df_read = pdx.from_avro('G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/users_test1.avro')
users_df_read

           name  age
0  Tushar Annam   25
1    James Bond   32

In [15]:
print(type(users_df_read))

<class 'pandas.core.frame.DataFrame'>

Getting the schemas from avro file

In [18]:
with open('G:/TUSHAR ANNAM/Python/datawithdarshil_python-for-data-engineering-main/python-for-data-engineering-main/5. Python for Data Engineering/data/users_test1.avro','rb') as f:
    reader = DataFileReader(f,DatumReader())
    metadata = copy.deepcopy(reader.meta)
    schema_from_file = json.loads(metadata['avro.schema'])
    reader.close()
print(schema_from_file)

{'type': 'record', 'name': 'Root', 'fields': [{'name': 'name', 'type': ['null', 'string']}, {'name': 'age', 'type': ['null', 'long']}]}

In [19]:
print(metadata)

{'avro.codec': b'null', 'avro.schema': b'{"type": "record", "name": "Root", "fields": [{"name": "name", "type": ["null", "string"]}, {"name": "age", "type": ["null", "long"]}]}'}